# Система управления автозаправочной станцией (АЗС)

import json
import os
from datetime import datetime

# Файлы данных
TANKS_FILE = "tanks.json"
STATS_FILE = "stats.json"
HISTORY_FILE = "history.json"
SYSTEM_FILE = "system.json"  # ← НОВОЕ: для хранения состояния аварии

# Цены на топливо (руб/л)
PRICES = {
    "АИ-92": 72.2,
    "АИ-95": 73.3,
    "АИ-98": 78.7,
    "ДТ": 84.0
}
# Минимальный уровень топлива (в литрах), при котором цистерна отключается
MIN_TANK_LEVEL = 2000

# Схема подключения колонок к цистернам
COLUMNS = {
    1: ["АИ-92", "АИ-95"],
    2: ["АИ-92", "АИ-95"],
    3: ["АИ-92", "АИ-95", "АИ-98", "ДТ"],
    4: ["АИ-92", "АИ-95", "АИ-98", "ДТ"],
    5: ["АИ-92", "АИ-95", "АИ-98", "ДТ"],
    6: ["АИ-92", "АИ-95", "АИ-98", "ДТ"],
    7: ["АИ-95", "ДТ"],
    8: ["АИ-95", "ДТ"]
}
